In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
students_performance = pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')

In [4]:
students_performance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
# Selecting data using Labels (Column Headings)

In [6]:
students_performance.gender[:5]

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [7]:
students_performance['gender'][:5]

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [8]:
students_performance[['gender', 'lunch']][:5]

   gender         lunch
0  female      standard
1  female      standard
2  female      standard
3    male  free/reduced
4    male      standard

In [9]:
# Slicing Subsets of Rows

In [10]:
students_performance[:3]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93

In [11]:
students_performance[-1:-3:-1]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,female,group D,some college,free/reduced,none,77,86,86
998,female,group D,some college,standard,completed,68,78,77

In [12]:
# Slicing Subsets of Rows and Columns

In [13]:
students_performance.iloc[-1:-3:-1, :3]

     gender race/ethnicity parental level of education
999  female        group D                some college
998  female        group D                some college

In [14]:
students_performance.loc[:5, ['gender', 'lunch']]

   gender         lunch
0  female      standard
1  female      standard
2  female      standard
3    male  free/reduced
4    male      standard
5  female      standard

In [15]:
students_performance.loc[[0, 1, 2], ['gender', 'lunch']]

   gender     lunch
0  female  standard
1  female  standard
2  female  standard

In [16]:
# Fast scalar value getting and setting

In [17]:
students_performance.at[0, 'gender']

'female'

In [18]:
students_performance.iat[0, 0]

'female'